Repository: meetrize/macquickfinder
Catalog: Sources/Explorer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.preview.preview_mode
source: Preview Mode
zh_hans: 预览方式

# settings.preview.preview_quicklook
source: QuickLook Preview
zh_hans: QuickLook 预览

# settings.preview.unavailable_hint
source: Add a custom preview rule for this type, or try QuickLook.
zh_hans: 可将此类型添加到自定义预览规则，或尝试 QuickLook。

# settings.preview.unavailable_title %@
source: Cannot preview %@ files
zh_hans: 无法预览 %@ 文件

# settings.preview.validation_extensions
source: Enter at least one valid extension.
zh_hans: 请至少填写一个有效扩展名。

# settings.snippets.display.minimal
source: Minimal
zh_hans: 极简

# settings.snippets.display.standard
source: Standard
zh_hans: 标准

# settings.snippets.display_mode
source: Panel display mode
zh_hans: 面板显示模式

# settings.tab.general
source: General
zh_hans: 通用

# settings.tab.preview
source: Preview
zh_hans: 预览

# settings.tab.shortcuts
source: Shortcuts
zh_hans: 快捷键

# settings.shortcut.cheat_sheet
source: Feature Cheat Sheet
zh_hans: 功能速查表

# settings.shortcut.click_to_record
source: Click to record a new shortcut
zh_hans: 点击以录制新快捷键

# settings.shortcut.close_detached_preview
source: Close Detached Preview
zh_hans: 关闭独立预览窗口

# settings.shortcut.global_toggle
source: Show / Hide App
zh_hans: 显示 / 隐藏应用

# settings.shortcut.global_toggle_enabled
source: Enable global shortcut
zh_hans: 启用全局快捷键

# settings.shortcut.global_toggle_footer
source: Works from any app. Shows MeoFind when hidden, or hides it when the app is active.
zh_hans: 可在任意应用中生效：隐藏时唤起 MeoFind，已在前台时则隐藏应用。

# settings.shortcut.recording_hint
source: Press the desired key combination. Esc cancels.
zh_hans: 按下目标组合键，Esc 取消。

# settings.shortcut.recording_placeholder
source: Press keys…
zh_hans: 请按键…

# settings.shortcut.reset
source: Reset
zh_hans: 恢复默认

# settings.shortcuts.category.files
source: Files
zh_hans: 文件

# settings.shortcuts.category.global
source: Global
zh_hans: 全局

# settings.shortcuts.category.navigation
source: Navigation
zh_hans: 导航

# settings.shortcuts.category.output
source: Output
zh_hans: 输出

# settings.shortcuts.category.panels
source: Panels
zh_hans: 面板

# settings.shortcuts.category.preview
source: Preview
zh_hans: 预览

# settings.shortcuts.category.system
source: System
zh_hans: 系统

# settings.window_snap
source: Enable window snap and linked movement
zh_hans: 启用窗口吸附与联动移动

# sidebar.devices
source: Devices
zh_hans: 设备

# sidebar.eject_device %@
source: Eject %@
zh_hans: 推出 %@

# sidebar.disconnect_device %@
source: Disconnect %@
zh_hans: 断开 %@

# sidebar.eject_failed %@
source: Could not disconnect %@. Close files using this volume and try again.
zh_hans: 无法断开 %@，请关闭正在使用该卷的窗口或文件后重试。

# sidebar.favorites
source: Favorites
zh_hans: 个人收藏

# sidebar.locations
source: Locations
zh_hans: 位置

# sidebar.no_devices
source: No devices
zh_hans: 无设备

# sidebar.trash
source: Trash
zh_hans: 废纸篓

# snippets.badge.directory
source: Dir
zh_hans: 目录

# snippets.badge.file
source: File
zh_hans: 文件

# snippets.badge.path
source: Path
zh_hans: 路径

# snippets.badge.single
source: 1 item
zh_hans: 1项

# snippets.builtin.copy_path
source: Copy Path
zh_hans: 复制路径

# snippets.builtin.finder_info
source: Show Finder Info
zh_hans: 显示 Finder 信息

# snippets.builtin.list_directory
source: List Directory
zh_hans: 列出目录

# snippets.builtin.open_default
source: Open with Default App
zh_hans: 用默认应用打开

# snippets.builtin.open_pdf
source: Open PDF (Preview)
zh_hans: 打开 PDF（预览）

# snippets.builtin.open_terminal
source: Open in Terminal
zh_hans: 在终端打开

# snippets.builtin.show_attributes
source: Show Attributes
zh_hans: 查看属性

# snippets.confirm.destructive_message
source: This Snippet may delete or move files. Continue?
zh_hans: 此 Snippet 可能删除或移动文件，确定执行？

# snippets.confirm.destructive_title
source: Dangerous Command
zh_hans: 危险命令确认

# snippets.confirm.proceed
source: Run Anyway
zh_hans: 仍要执行

# snippets.editor.content
source: Content
zh_hans: 内容

# snippets.editor.edit_title
source: Edit Snippet
zh_hans: 编辑 Snippet

# snippets.editor.extensions_placeholder
source: Extensions (comma-separated, e.g. pdf, md)
zh_hans: 扩展名（逗号分隔，如 pdf, md）

# snippets.editor.interpreter
source: Interpreter
zh_hans: 解释器

# snippets.editor.name
source: Name
zh_hans: 名称

# snippets.editor.new_title
source: New Snippet
zh_hans: 新建 Snippet

# snippets.editor.paths_placeholder
source: File paths (one per line)
zh_hans: 文件路径（每行一个）

# snippets.editor.scope
source: Scope
zh_hans: 作用域

# snippets.editor.script_type
source: Script Type
zh_hans: 脚本类型

# snippets.editor.terminal_hint
source: Runs in Terminal or similar; output is not shown in the in-app panel
zh_hans: 在 Terminal 等应用中运行，输出不显示在应用内面板

# snippets.editor.use_system_terminal
source: Use System Terminal
zh_hans: 使用系统终端

# snippets.import.rename_suffix
source: (imported)
zh_hans: （导入）

# snippets.import.rename_suffix %lld
source: (imported %lld)
zh_hans: （导入 %lld）

# snippets.output.cancelled
source: Cancelled
zh_hans: 已取消

# snippets.output.clear
source: Clear
zh_hans: 清屏

# snippets.output.close_all
source: Close All
zh_hans: 关闭所有

# snippets.output.close_current
source: Close Tab
zh_hans: 关闭当前

# snippets.output.close_others
source: Close Others
zh_hans: 关闭其他

# snippets.output.close_panel
source: Close Output Panel
zh_hans: 关闭输出面板

# snippets.output.collapse
source: Collapse Output Panel
zh_hans: 折叠输出面板

# snippets.output.command_failed %lld
source: Command failed with exit code %lld
zh_hans: 命令失败，退出码 %lld

# snippets.output.command_placeholder
source: Expanded command; press Return to rerun
zh_hans: 展开后的命令，回车重新执行

# snippets.output.copy
source: Copy
zh_hans: 复制

# snippets.output.empty_hint
source: Run a Snippet to see output here
zh_hans: 执行 Snippet 后在此查看输出

# snippets.output.exit_code %lld
source: Exit code %lld
zh_hans: 退出码 %lld

# snippets.output.expand
source: Expand Output Panel
zh_hans: 展开输出面板

# snippets.output.find
source: Find
zh_hans: 查找

# snippets.output.run_history_command
source: Run this command
zh_hans: 直接执行此命令

# snippets.output.no_output
source: (no output)
zh_hans: （无输出）

# snippets.output.queued
source: Queued
zh_hans: 排队中

# snippets.output.running
source: Running…
zh_hans: 运行中…

# snippets.output.stop
source: Stop
zh_hans: 停止

# snippets.output.truncated
source: [Output truncated: maximum size reached]
zh_hans: [输出已截断：已达单 Tab 输出上限]

# snippets.panel.close
source: Close Snippets
zh_hans: 关闭 Snippets

# snippets.panel.collapse
source: Collapse Snippets
zh_hans: 折叠 Snippets

# snippets.panel.execute
source: Run
zh_hans: 执行

# snippets.panel.execute_in_terminal
source: Run in Terminal
zh_hans: 在终端中执行

# snippets.panel.expand
source: Expand Snippets
zh_hans: 展开 Snippets

# snippets.panel.export_all
source: Export All…
zh_hans: 导出全部…

# snippets.panel.export_single
source: Export This Snippet
zh_hans: 导出此条

# snippets.panel.import
source: Import…
zh_hans: 导入…

# snippets.panel.import_button
source: Import
zh_hans: 导入

# snippets.panel.import_conflict_message %lld
source: %lld snippets conflict with existing items
zh_hans: 有 %lld 条与现有 Snippet 冲突

# snippets.panel.import_conflict_title
source: Import Conflict
zh_hans: 导入冲突

# snippets.panel.import_done_message %lld %lld
source: Imported %lld, skipped %lld
zh_hans: 已导入 %lld 条，跳过 %lld 条

# snippets.panel.import_done_title
source: Import Complete
zh_hans: 导入完成

# snippets.panel.import_export
source: Import / Export
zh_hans: 导入 / 导出

# snippets.panel.import_failed_title
source: Import Failed
zh_hans: 导入失败

# snippets.panel.import_strategy_label
source: Resolution
zh_hans: 处理方式

# snippets.panel.new
source: New
zh_hans: 新建

# snippets.panel.no_match
source: No snippets match the current context
zh_hans: 当前上下文无匹配 Snippet

# snippets.panel.no_results
source: No search results
zh_hans: 无搜索结果

# snippets.panel.search_prompt
source: Search name or script content…
zh_hans: 搜索名称或脚本内容…

# snippets.scope.anytime
source: Always
zh_hans: 始终

# snippets.scope.directories_only
source: Directories Only
zh_hans: 仅目录

# snippets.scope.file_extensions
source: Specific Extensions
zh_hans: 指定扩展名

# snippets.scope.files_only
source: Files Only
zh_hans: 仅文件

# snippets.scope.global
source: When Items Selected
zh_hans: 有选中项

# snippets.scope.single_selection
source: Single Selection
zh_hans: 单选

# snippets.scope.specific_files
source: Specific Files
zh_hans: 指定文件

# snippets.strategy.overwrite
source: Overwrite
zh_hans: 覆盖

# snippets.strategy.rename
source: Rename
zh_hans: 重命名

# snippets.strategy.skip
source: Skip
zh_hans: 跳过

# sort.date_newest
source: Date (Newest First)
zh_hans: 日期 (最新优先)

# sort.date_oldest
source: Date (Oldest First)
zh_hans: 日期 (最早优先)

# sort.name_ascending
source: Name (A to Z)
zh_hans: 名称 (A 到 Z)

# sort.name_descending
source: Name (Z to A)
zh_hans: 名称 (Z 到 A)

# sort.size_largest
source: Size (Largest First)
zh_hans: 大小 (最大优先)

# sort.size_smallest
source: Size (Smallest First)
zh_hans: 大小 (最小优先)

# toolbar.customize
source: Customize Toolbar…
zh_hans: 自定义工具栏…

# toolbar.customize.title
source: Customize Toolbar
zh_hans: 自定义工具栏

# toolbar.customize.hint
source: Drag items into the toolbar to add them. Drag items out to remove them.
zh_hans: 将项目拖到工具栏以添加；将项目拖出工具栏以移除。

# toolbar.customize.done
source: Done
zh_hans: 完成

# toolbar.customize.cancel
source: Cancel
zh_hans: 取消

# toolbar.customize.reset
source: Restore Defaults
zh_hans: 恢复默认

# toolbar.customize.add_open_app
source: Add Toolbar Item…
zh_hans: 添加工具栏项…

# toolbar.open_app.title
source: Add Toolbar Item
zh_hans: 添加工具栏项

# toolbar.open_app.name
source: Name
zh_hans: 名称

# toolbar.open_app.choose
source: Choose…
zh_hans: 选择…

# toolbar.open_app.choose_prompt
source: Choose an application
zh_hans: 选择应用程序

# toolbar.open_app.use_app_icon
source: Use application icon
zh_hans: 使用应用图标

# toolbar.open_app.add
source: Add
zh_hans: 添加

# toolbar.open_app.save
source: Save
zh_hans: 存储

# toolbar.open_app.edit
source: Edit Toolbar Item…
zh_hans: 编辑工具栏项…

# toolbar.open_app.edit_title
source: Edit Toolbar Item
zh_hans: 编辑工具栏项

# toolbar.open_app.selection_policy
source: Selection Policy
zh_hans: 选中项策略

# toolbar.open_app.selection_require
source: Require selected items
zh_hans: 必须选中文件或文件夹

# toolbar.open_app.selection_optional
source: Pass selection when available
zh_hans: 无选中也可运行，选中时传递

# toolbar.open_app.selection_current_folder
source: Pass current folder
zh_hans: 将当前文件夹作为参数

# toolbar.open_app.selection_policy_help
source: Require selection: at least one item must be selected. Pass when available: passes selected items if any, otherwise launches the app without files. Current folder: always passes the folder you are browsing.
zh_hans: 必须选中：需先选中文件或文件夹再运行。无选中也可运行：有选中时传递选中项，否则直接启动应用。当前文件夹：始终将当前浏览的文件夹路径传给应用。

# toolbar.open_app.tooltip
source: Open with %@
zh_hans: 用 %@ 打开

# toolbar.error.no_selection
source: Select one or more items first
zh_hans: 需要先选中文件

# toolbar.error.app_missing_title
source: Application Not Found
zh_hans: 找不到应用

# toolbar.error.app_missing
source: Application “%@” could not be found. Reconfigure it in Customize Toolbar.
zh_hans: 找不到应用「%@」，请在自定义工具栏中重新配置。

# toolbar.auto_folder_size
source: Calculate All Folder Sizes
zh_hans: 自动计算文件夹大小

# toolbar.use_icon_preview
source: Use Icon Preview
zh_hans: 使用图标预览

# toolbar.browse_settings
source: Browse Settings
zh_hans: 浏览设置

# toolbar.hide_left_panel
source: Hide Left Panel
zh_hans: 隐藏左侧面板

# toolbar.list_view
source: List View
zh_hans: 列表视图

# toolbar.new_folder
source: New Folder
zh_hans: 新建文件夹

# toolbar.delete
source: Delete
zh_hans: 删除

# toolbar.show_left_panel
source: Show Left Panel
zh_hans: 显示左侧面板

# toolbar.thumbnail_size
source: Icon Size
zh_hans: 缩略图大小

# toolbar.thumbnail_view
source: Icon View
zh_hans: 缩略图视图

# toolbar.view_picker
source: View
zh_hans: 视图

# help.window_title
source: MeoFind Cheat Sheet
zh_hans: MeoFind 功能速查表

# help.cheat_sheet_menu
source: Cheat Sheet
zh_hans: 功能速查表

# help.subtitle
source: A quick overview of what MeoFind can do
zh_hans: 一句话了解 MeoFind 能做什么

# help.column.feature
source: Feature
zh_hans: 功能

# help.column.description
source: Description
zh_hans: 说明

# help.column.shortcut
source: Shortcut
zh_hans: 快捷键

# help.section.navigation
source: Browse & Navigate
zh_hans: 浏览与导航

# help.section.sidebar
source: Sidebar
zh_hans: 侧边栏

# help.section.remote_server
source: Remote Server
zh_hans: 远程服务器

# help.section.files
source: File Actions
zh_hans: 文件操作

# help.section.preview
source: Preview
zh_hans: 预览

# help.section.output
source: Output Panel
zh_hans: 输出面板

# help.section.layout
source: Window & Layout
zh_hans: 窗口与布局

# help.section.settings
source: Settings
zh_hans: 设置

# help.section.toolbar
source: Toolbar
zh_hans: 工具栏

# help.section.permissions
source: Permissions
zh_hans: 权限

# help.entry.file_list.name
source: File List
zh_hans: 文件列表

# help.entry.file_list.desc
source: Browse files and folders in list or thumbnail view
zh_hans: 当前目录下的文件与文件夹，支持列表与缩略图两种视图

# help.entry.list_view.name
source: List View
zh_hans: 列表视图

# help.entry.list_view.desc
source: Table with name, type, size, dates; click headers to sort
zh_hans: 表格显示名称、类型、大小、日期等列，可点击表头排序

# help.entry.list_view.shortcut
source: Toolbar
zh_hans: 工具栏

# help.entry.thumbnail_view.name
source: Thumbnail View
zh_hans: 缩略图视图

# help.entry.thumbnail_view.desc
source: Icon grid; drag slider to resize thumbnails
zh_hans: 图标网格浏览，可拖动滑块调整缩略图大小

# help.entry.thumbnail_view.shortcut
source: Toolbar
zh_hans: 工具栏

# help.entry.path_breadcrumb.name
source: Path Breadcrumb
zh_hans: 路径面包屑

# help.entry.path_breadcrumb.desc
source: Click segments to jump; middle segments collapse when space is tight
zh_hans: 点击路径段快速跳转，空间不足时自动折叠中间段

# help.entry.path_edit.name
source: Path Editing
zh_hans: 路径编辑

# help.entry.path_edit.desc
source: Click the path bar to type or paste a full path
zh_hans: 点击路径栏可手动输入或粘贴完整路径

# help.entry.back_forward.name
source: Back / Forward
zh_hans: 前进 / 后退

# help.entry.back_forward.desc
source: Navigate through browsing history
zh_hans: 在浏览历史中前进或后退

# help.entry.path_history.name
source: Path History
zh_hans: 路径历史

# help.entry.path_history.desc
source: Drop down to see recently visited folders
zh_hans: 下拉查看最近访问过的目录

# help.entry.quick_search.name
source: Quick Search
zh_hans: 快速搜索

# help.entry.quick_search.desc
source: Type to filter the list; Tab cycles matches and syncs preview
zh_hans: 输入即过滤当前列表，Tab 循环匹配项并同步预览

# help.entry.quick_search.shortcut
source: Type
zh_hans: 直接打字

# help.entry.global_search.name
source: Search Field
zh_hans: 全局搜索框

# help.entry.global_search.desc
source: Focus toolbar search to filter by filename
zh_hans: 工具栏搜索框聚焦，按文件名筛选

# help.entry.double_click_open.name
source: Double-Click Open
zh_hans: 双击打开

# help.entry.double_click_open.desc
source: Open folders or files with the default app
zh_hans: 文件夹进入、文件用默认应用打开

# help.entry.double_click_open.shortcut
source: Double-click
zh_hans: 双击

# help.entry.blank_double_click.name
source: Blank Double-Click
zh_hans: 空白处双击

# help.entry.blank_double_click.desc
source: Go to parent folder or open Terminal here (Settings)
zh_hans: 可设为返回上级目录或在当前目录打开终端

# help.entry.blank_double_click.shortcut
source: Settings
zh_hans: 设置

# help.entry.drag_drop_open.name
source: Drag & Drop
zh_hans: 拖放打开

# help.entry.drag_drop_open.desc
source: Drop files or folders into the window to navigate
zh_hans: 将文件或文件夹拖入窗口可导航到对应位置

# help.entry.external_open.name
source: Open Externally
zh_hans: 外部打开

# help.entry.external_open.desc
source: Open from Finder or as the default file manager
zh_hans: 从 Finder 拖入或作为默认文件管理器打开文件夹

# help.entry.favorites.name
source: Favorites
zh_hans: 收藏夹

# help.entry.favorites.desc
source: Pin frequent folders; add or remove via context menu
zh_hans: 固定常用目录，右键可添加或移除收藏

# help.entry.locations.name
source: Locations
zh_hans: 位置

# help.entry.locations.desc
source: Quick access to Home, Desktop, Documents, Downloads, etc.
zh_hans: 快速访问主目录、桌面、文稿、下载等系统位置

# help.entry.devices.name
source: Devices
zh_hans: 设备

# help.entry.devices.desc
source: Shows mounted disks, removable drives, and network shares; eject supported
zh_hans: 动态显示已挂载的磁盘、移动硬盘与网络卷，可推出

# help.entry.connect_server.name
source: Connect to Server
zh_hans: 连接服务器

# help.entry.connect_server.desc
source: Connect SMB, AFP, or FTP shares; mounted volumes appear in Devices
zh_hans: 连接 SMB、AFP 或 FTP 共享，挂载后卷出现在设备中

# help.entry.recent_servers.name
source: Recent Servers
zh_hans: 最近服务器

# help.entry.recent_servers.desc
source: Quickly reconnect from the list in the connect dialog
zh_hans: 在连接对话框中从最近列表快速重连

# help.entry.trash.name
source: Trash
zh_hans: 废纸篓

# help.entry.trash.desc
source: Browse deleted items; put back or empty trash
zh_hans: 浏览已删除文件，支持放回原处与清空

# help.entry.toggle_left_panel.name
source: Left Panel
zh_hans: 左侧面板

# help.entry.toggle_left_panel.desc
source: Show or hide the sidebar
zh_hans: 显示或隐藏侧边栏

# help.entry.open.name
source: Open
zh_hans: 打开

# help.entry.open.desc
source: Open files or enter folders with the default handler
zh_hans: 用默认方式打开文件或进入文件夹

# help.entry.open.shortcut
source: Return
zh_hans: 回车

# help.entry.open_new_window.name
source: Open in New Window
zh_hans: 新窗口打开

# help.entry.open_new_window.desc
source: Open a folder in a separate window
zh_hans: 在独立窗口中打开文件夹

# help.entry.open_new_window.shortcut
source: Right-click
zh_hans: 右键

# help.entry.open_with.name
source: Open With
zh_hans: 打开方式

# help.entry.open_with.desc
source: Choose another app to open a file
zh_hans: 选择其他应用打开文件

# help.entry.open_with.shortcut
source: Right-click
zh_hans: 右键

# help.entry.cut_copy_paste.name
source: Cut / Copy / Paste
zh_hans: 剪切 / 复制 / 粘贴

# help.entry.cut_copy_paste.desc
source: Standard file clipboard operations
zh_hans: 标准文件剪贴板操作

# help.entry.delete.name
source: Delete
zh_hans: 删除

# help.entry.delete.desc
source: Move selected items to Trash
zh_hans: 将选中项移入废纸篓

# help.entry.delete_immediately.name
source: Delete Immediately
zh_hans: 立即删除

# help.entry.delete_immediately.desc
source: Permanently delete from Trash, bypassing Trash
zh_hans: 废纸篓内永久删除，跳过废纸篓

# help.entry.delete_immediately.shortcut
source: Right-click
zh_hans: 右键

# help.entry.put_back.name
source: Put Back
zh_hans: 放回原处

# help.entry.put_back.desc
source: Restore items from Trash to their original location
zh_hans: 从废纸篓恢复文件到原位置

# help.entry.put_back.shortcut
source: Right-click
zh_hans: 右键

# help.entry.empty_trash.name
source: Empty Trash
zh_hans: 清空废纸篓

# help.entry.empty_trash.desc
source: Permanently erase all items in Trash
zh_hans: 永久清空废纸篓全部内容

# help.entry.empty_trash.shortcut
source: Right-click
zh_hans: 右键

# help.entry.rename.name
source: Rename
zh_hans: 重命名

# help.entry.rename.desc
source: Click the name again or use the context menu
zh_hans: 再次点击文件名或右键重命名

# help.entry.new_folder_file.name
source: New Folder / File
zh_hans: 新建文件夹 / 文件

# help.entry.new_folder_file.desc
source: Create a new folder or file in the current directory
zh_hans: 在当前目录创建新文件夹或文件

# help.entry.new_folder_file.shortcut
source: Right-click
zh_hans: 右键

# help.entry.copy_name_path.name
source: Copy Name / Path
zh_hans: 复制文件名 / 路径

# help.entry.copy_name_path.desc
source: Copy filename or full path to the clipboard
zh_hans: 将选中项名称或完整路径复制到剪贴板

# help.entry.copy_name_path.shortcut
source: Right-click
zh_hans: 右键

# help.entry.open_terminal.name
source: Open Terminal Here
zh_hans: 在此处打开终端

# help.entry.open_terminal.desc
source: Launch the system Terminal in the selected folder
zh_hans: 在选中目录启动系统终端

# help.entry.open_terminal.shortcut
source: Right-click
zh_hans: 右键

# help.entry.show_info.name
source: Get Info
zh_hans: 属性

# help.entry.show_info.desc
source: Separate window with size, permissions, tags, comments, etc.
zh_hans: 独立窗口查看大小、权限、标签、注释等详情

# help.entry.show_info.shortcut
source: Right-click
zh_hans: 右键

# help.entry.services.name
source: Services
zh_hans: 服务

# help.entry.services.desc
source: Invoke macOS Services menu actions
zh_hans: 调用 macOS 系统服务菜单

# help.entry.services.shortcut
source: Right-click
zh_hans: 右键

# help.entry.add_favorite.name
source: Add to Favorites
zh_hans: 收藏

# help.entry.add_favorite.desc
source: Add a folder to sidebar Favorites
zh_hans: 将文件夹加入侧边栏收藏夹

# help.entry.add_favorite.shortcut
source: Right-click
zh_hans: 右键

# help.entry.file_preview.name
source: File Preview
zh_hans: 文件预览

# help.entry.file_preview.desc
source: Live preview in the right panel without leaving the browser
zh_hans: 右侧面板实时预览选中文件，无需离开浏览器

# help.entry.text_code.name
source: Text / Code
zh_hans: 文本 / 代码

# help.entry.text_code.desc
source: Syntax highlighting, line numbers, wrap, zoom, in-preview search
zh_hans: 语法高亮、行号、换行、字体缩放、文内搜索

# help.entry.text_code.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.markdown_html.desc
source: Switch between source and rendered modes
zh_hans: 源码与渲染模式切换

# help.entry.markdown_html.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.image.name
source: Images
zh_hans: 图片

# help.entry.image.desc
source: Zoom, rotate, flip, eyedropper, basic edit and save
zh_hans: 缩放、旋转、翻转、取色、简单编辑与保存

# help.entry.image.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.pdf.desc
source: Page through, zoom, fit width or page
zh_hans: 翻页、缩放、适应宽度或页面

# help.entry.pdf.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.media.name
source: Audio / Video
zh_hans: 音视频

# help.entry.media.desc
source: Play, pause, mute
zh_hans: 播放、暂停、静音

# help.entry.media.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.archive.name
source: Archives
zh_hans: 压缩包

# help.entry.archive.desc
source: Browse file listings inside ZIP, TAR, and similar archives
zh_hans: 浏览 ZIP、TAR 等归档内文件列表

# help.entry.spreadsheet.name
source: Spreadsheets
zh_hans: 电子表格

# help.entry.spreadsheet.desc
source: Switch between text mode and Quick Look preview
zh_hans: 文本模式与 Quick Look 预览切换

# help.entry.spreadsheet.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.quick_look.desc
source: Fall back to system Quick Look for unsupported types
zh_hans: 对不支持的类型回退到系统 Quick Look

# help.entry.in_preview_search.name
source: In-Preview Search
zh_hans: 文内搜索

# help.entry.in_preview_search.desc
source: Find and highlight matches inside preview content
zh_hans: 在预览内容中查找并高亮，跳转下一处匹配

# help.entry.in_preview_search.shortcut
source: Preview toolbar
zh_hans: 预览工具栏

# help.entry.detach_preview.name
source: Detached Preview
zh_hans: 独立预览窗口

# help.entry.detach_preview.desc
source: Pop preview into its own window; list stays in the main window
zh_hans: 将预览拖出为独立窗口，主窗口仍保留列表

# help.entry.preview_browser.name
source: Preview Browser
zh_hans: 预览浏览器

# help.entry.preview_browser.desc
source: Filmstrip at the bottom to browse files in the current folder
zh_hans: 底部胶片条浏览当前目录文件，上一项 / 下一项

# help.entry.custom_preview_rules.name
source: Custom Preview Rules
zh_hans: 自定义预览规则

# help.entry.custom_preview_rules.desc
source: Assign preview modes by extension; import and export rules
zh_hans: 按扩展名指定预览方式，可导入导出规则

# help.entry.custom_preview_rules.shortcut
source: Settings
zh_hans: 设置

# help.entry.snippets_panel.name
source: Snippets Panel
zh_hans: Snippets 面板

# help.entry.snippets_panel.desc
source: Reusable scripts in the right panel, filtered by context
zh_hans: 右侧面板管理可复用脚本，按上下文过滤显示

# help.entry.run_snippet.name
source: Run Snippet
zh_hans: 执行片段

# help.entry.run_snippet.desc
source: Search, arrow keys, Return or double-click to run
zh_hans: 搜索、方向键选择、回车或双击运行

# help.entry.scope.name
source: Scope
zh_hans: 作用域

# help.entry.scope.desc
source: Limit when a snippet appears by context, type, or path
zh_hans: 按全局、文件类型、路径等限制片段出现时机

# help.entry.variables.name
source: Variable Expansion
zh_hans: 变量展开

# help.entry.variables.desc
source: %p (path), %d (directory), and more are expanded at run time
zh_hans: 脚本中 %p（路径）、%d（目录）等自动替换

# help.entry.create_edit.name
source: Create / Edit
zh_hans: 新建 / 编辑

# help.entry.create_edit.desc
source: Shell, Python, AppleScript, and other script types
zh_hans: 支持 Shell、Python、AppleScript 等类型
